# Customer API - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/customer/customer-api/infrastructure/workspaces/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/staging-customer-api/runs/run-sJ8NggBw9qqsdvqo

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.aws_lambda.data.archive_file.default: Refreshing...
module.database_user.random_password.password: Refreshing state... [id=none]
module.database_user.data.aws_ssm_parameter.cluster_id: Refreshing...
module.aws_lambda.data.aws_iam_policy_document.default: Refreshing...
module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=3fa3q8icd5]
data.aws_ssm_parameter.cluster_id: Refreshing...
module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/lambda-staging-customer-api-customer-api]
module.aws_lambda.data.aws_iam_policy_document.default: Refresh complete after 0s [id=3693445097]
module.aws_lambda.aws_iam_role.default: Refreshing state... [id=lambda-execution-customer-api-staging-customer-api]
module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-customer-api-staging-customer-api-20230425082215561500000001]
module.aws_lambda.data.archive_file.default: Refresh complete after 1s [id=9f8185544c5882212e48a2b70c764b996761e096]
module.database_user.data.aws_ssm_parameter.cluster_id: Refresh complete after 1s [id=staging-customer-database-cluster-id]
module.database_user.cockroach_sql_user.default: Refreshing state... [id=a9d76d5e-fdb9-4bb9-941d-800d6d400e8d:customer-api]
data.aws_ssm_parameter.cluster_id: Refresh complete after 1s [id=staging-customer-database-cluster-id]
module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/api-gateway-staging-customer-api-customer-api]
module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=lambda-staging-customer-api-customer-api]
module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=uoly36n]
module.aws_api_gateway.aws_apigatewayv2_route.any: Refreshing state... [id=0pcjhrf]
module.aws_lambda.aws_lambda_function.default: Drift detected (update)
module.aws_lambda.aws_iam_role.default: Drift detected (update)
module.aws_api_gateway.aws_apigatewayv2_stage.default: Drift detected (update)
module.aws_api_gateway.aws_apigatewayv2_api.default: Drift detected (update)
module.aws_api_gateway.aws_apigatewayv2_integration.default: Drift detected (update)
module.aws_api_gateway.aws_apigatewayv2_route.any: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "customer"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "customer-api"
    }

  # module.aws_lambda.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "lambda-staging-customer-api-customer-api"
        tags                           = {
            "domain"        = "customer"
            "environment"   = "staging-customer-api"
            "resource"      = "customer-api"
            "resource_type" = "lambda"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING" = "postgresql://customer-api:DZXkszW3Z4o9%7DZXR2l5is%25%5Byfw%3E%29%28xKrNIo%23rc%7BYp0J%3FPPwBnd9Ucj%2A3%3CK_%2AI%28lK@staging-customer-4521.6xw.cockroachlabs.cloud:26257/customer?sslmode=verify-full"
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "a9d76d5e-fdb9-4bb9-941d-800d6d400e8d:customer-api"
        name       = "customer-api"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "22343e6e-1e75-470e-8476-32e1630d91ac" -> "a6aa0a9d-d19e-43c0-a9a8-c72d6d5404a3"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ customer_api_connection_string = (sensitive value)

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*